# Customers who didn’t buy a product

Source: https://towardsdatascience.com/twenty-five-sql-practice-exercises-5fc791e24082

From the following table, write a query to display the ID and name of customers who bought products A and B, but didn’t buy product C, ordered by ascending customer ID.

In [1]:
%load_ext sql
%sql postgresql://fknight:@localhost/postgres

In [2]:
%%html
<style>
table {float:left}
</style>

## The `customers` table

In [6]:
%%sql

DROP TABLE IF EXISTS customers;
CREATE TABLE customers (
    id INT,
    name VARCHAR(20)
);

INSERT INTO customers
VALUES
    (1, 'Daniel'),
    (2, 'Diana'), 
    (3, 'Elizabeth'), 
    (4, 'John');

SELECT * FROM customers;

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
4 rows affected.
4 rows affected.

[(1, 'Daniel'), (2, 'Diana'), (3, 'Elizabeth'), (4, 'John')]

## The `orders` table

In [8]:
%%sql

DROP TABLE IF EXISTS orders;
CREATE TABLE orders (
    order_id INT,
    customer_id INT,
    product_name VARCHAR(1)
);

INSERT INTO orders
VALUES
    (1, 1, 'A'),
    (2, 1, 'B'),
    (3, 2, 'A'), 
    (4, 2, 'B'), 
    (5, 2, 'C'), 
    (6, 3, 'A'), 
    (7, 3, 'A'), 
    (8, 3, 'B'), 
    (9, 3, 'D');

SELECT * FROM orders;

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
9 rows affected.
9 rows affected.

[(1, 1, 'A'),
 (2, 1, 'B'),
 (3, 2, 'A'),
 (4, 2, 'B'),
 (5, 2, 'C'),
 (6, 3, 'A'),
 (7, 3, 'A'),
 (8, 3, 'B'),
 (9, 3, 'D')]

## The expected output

| id | name      |
|--- |---------- |
| 1  | Daniel    |
| 3  | Elizabeth |

# Type your SQL below

In [9]:
# %%sql
#
# Type your query here